[
  {
    "title": "Who am I",
    "text": "I'm a self-taught software dev, and online, I call myself kutoru. 2020 was the year when I wrote my first lines of code, and for a while, coding was nothing more than a little side hobby for me. Starting in 2023, I started getting more serious about it and investing much more time into software. For the last 2 years, I've been mainly working on web-related projects, but from time to time I enjoy writing something different as well.\nI'm curious about many technologies, and for me, one of my motivations to move forward is a desire to learn things that I had absolutely no experience with in the past. Because of that, I usually challenge myself with complex tasks, both to learn something new and to improve as a developer generally.\nWhile I do have some <a href=\"/projects#Admin%20Panel\">professional experience</a>, most of my skills come from personal projects that are available on my <a href=\"https://github.com/kutoru\">GitHub</a>. One of my most notable projects that might be worth checking out is <a href=\"/projects#Miku%20Notes\">Miku Notes</a>."
  },
  {
    "title": "What is this website about",
    "text": "Approximately a year ago, I created a static <a href=\"https://kutoru.github.io/me\">website</a>, that contained the information about me and my software projects. Here, is an updated version of that website.\nOn <a href=\"/\">this</a> page, I listed some notable skills that I have, as well as some general information about myself. On the <a href=\"/projects\">Projects</a> page, I included all the notable projects that I have ever worked on."
  },
  {
    "title": "What am I about",
    "text": "I am a person that is interested in a wide range of things, and really passionate about a few of them. Notably, my hobbies include gaming, music production, language learning (English and Japanese), and of course, software development. Since this website is mainly about me as a software developer, the rest of this section will tell about my software dev journey.\nI wrote a bit about what I did before 2023 <a href=\"/projects#Everything%20before\">here</a>, and as I mentioned above, starting from 2023, I decided to heavily invest my time and effort into software development. In the very beginning, I wasn't sure what I wanted to work on exactly, and even though the only language I knew at the time was Python, somehow I got very interested in C++, and so I started learning it and writing some projects with it.\nWhile writing projects with C++ (I wrote about one of them <a href=\"/projects#Sudoku%20GUI\">here</a>), I started getting invested into the software dev community. Specifically, I really got into <a href=\"https://www.youtube.com/@ThePrimeagen\">Primeagen</a>'s and <a href=\"https://www.youtube.com/@t3dotgg\">Theo</a>'s content and their people. Thanks to Prime, I got into Vim motions and Rust, which is still my favorite language btw. And thanks to Theo, for better or for worse, I eventually decided to transition into web development, in which I'm still interested.\nDuring summer 2023, I thought that it was time to get out of my comfort zone and start looking for an actual job. Not only have I started getting more into LeetCode problems and DSA in general, but I have also continued writing code. Most of my projects from that time are still available on my <a href=\"https://github.com/kutoru\">GitHub</a>.\nAfter looking for a job for quite some time, eventually, in September 2023, I got a job at a startup. Of course, in the beginning, I was excited to finally have such opportunity, but as it usually happens, the reality wasn't as great as I initially thought. I already wrote about my dissatisfactions at that place on the <a href=\"/projects#Admin%20Panel\">Projects</a> page, so I'm not going to repeat myself here. After working for about 6 months there and nearly burning out, I quit and decided to take a break from software for a bit.\nFrom there, I coded intermittently for quite some time, and then in summer 2024, I decided to get back into the grind. Since then, most notably I worked on a project called Miku Notes, that you can read about <a href=\"/projects#Miku%20Notes\">here</a>. Looking back at this project and comparing it to the older ones, it does feel like I'm still actively improving, and I guess that's a good indication that I'm on the right path. And that pretty much brings the story to my current state. Still looking for a new job, and still trying to get even better at coding."
  }
]
